app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 21 Dec 2014 17:42:50 UTC +00:00], ["name", "test"], ["updated_at", Sun, 21 Dec 2014 17:42:50 UTC +00:00]]
---
  def create
    @category = Category.new(category_params)

    if @category.save