app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id]) #params change when nested
    @comment = @post.comments.build(params.require(:comment).permit(:body))
    @comment.creator = current_user #changed from User.first once had authentication established

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Comment with user id\r\n"], ["created_at", Mon, 22 Dec 2014 01:18:40 UTC +00:00], ["post_id", 1], ["updated_at", Mon, 22 Dec 2014 01:18:40 UTC +00:00], ["user_id", 1]]

  def vote
    comment = Comment.find(params[:id])
    vote = Vote.create(vote: params[:vote], creator: current_user, voteable: comment)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 23 Jan 2015 23:11:38 UTC +00:00], ["updated_at", Fri, 23 Jan 2015 23:11:38 UTC +00:00], ["user_id", 6], ["vote", true], ["voteable_id", 10], ["voteable_type", "Comment"]]