app/controllers/posts_controller.rb

  def index
    @posts = Post.all.sort_by{|x| x.total_votes}.reverse
---
SELECT "posts".* FROM "posts"

  def create

    @post = Post.new(post_params)
    @post.creator = current_user # TODO: changed from User.first once we have authentitcation

    if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 12 Dec 2014 23:10:41 UTC +00:00], ["description", "blah"], ["title", "bla "], ["updated_at", Fri, 12 Dec 2014 23:10:41 UTC +00:00], ["url", "blah"], ["user_id", 1]]

  def vote
    vote = Vote.create(vote: params[:vote], creator: current_user, voteable: @post)
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 23 Jan 2015 00:06:01 UTC +00:00], ["updated_at", Fri, 23 Jan 2015 00:06:01 UTC +00:00], ["user_id", 6], ["vote", false], ["voteable_id", 1], ["voteable_type", "Post"]]

  def set_post
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 13]]